zyn810039594/OurEDA-B1S/Sensor/WT931/示例程序/STM32/STM32Core IIC写入校准指令/Source/APP/Main.c
/*
编写者：Kevin
网址：http://RobotControl.taobao.com
作者E-mail：1609370741@qq.com
编译环境：MDK-Lite  Version: 5.17
初版时间: 2016-1-31
测试： 本程序已在【君悦智控】的STM32Core平台上完成测试
功能：
用STM32Core平台IIC接口读取JY901的数据，然后通过串口1打印到串口助手。
接线
USB-TTL工具                 STM32Core              JY901
VCC          -----           VCC        ----        VCC
TX           -----           RX1     
RX           -----           TX1
GND          -----           GND        ----        GND
                             SDA2       ----        SDA
														 SCL2       ----        SCL
------------------------------------
 */
#include <string.h>
#include <stdio.h>
#include "Main.h"
#include "REG.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "UART1.h"
#include "delay.h"
#include "IOI2C.h"

void ShortToChar(short sData,unsigned char cData[])
{
	cData[0]=sData&0xff;
	cData[1]=sData>>8;
}
short CharToShort(unsigned char cData[])
{
	return ((short)cData[1]<<8)|cData[0];
}

int main(void)
{  
  unsigned char chrTemp[30];
	unsigned char i=0;
	unsigned char cmd1[2] = {0X00,0X01};//可以参考一下使用说明书对寄存器写入的值
	//unsigned char cmd0[2] = {0X00,0X00};//可以参考一下使用说明书对寄存器写入的值
	float a[3],w[3],h[3],Angle[3];
		
	SysTick_init(72,10);
	Initial_UART1(9600);
	IIC_Init();
	delay_ms(1000);//等待模块初始化完成

	while (1)
	{

		delay_ms(1000);
		IICreadBytes(0x50, AX, 24,&chrTemp[0]);//读取从AX寄存器之后的24个字节长度的数据，也就是XYZ的加速度角速度磁场和角度
		a[0] = (float)CharToShort(&chrTemp[0])/32768*16;//高低字节合并成一个16位长度的数据进行计算
		a[1] = (float)CharToShort(&chrTemp[2])/32768*16;
		a[2] = (float)CharToShort(&chrTemp[4])/32768*16;
		w[0] = (float)CharToShort(&chrTemp[6])/32768*2000;
		w[1] = (float)CharToShort(&chrTemp[8])/32768*2000;
		w[2] = (float)CharToShort(&chrTemp[10])/32768*2000;
		h[0] = CharToShort(&chrTemp[12]);
		h[1] = CharToShort(&chrTemp[14]);
		h[2] = CharToShort(&chrTemp[16]);
		Angle[0] = (float)CharToShort(&chrTemp[18])/32768*180;
		Angle[1] = (float)CharToShort(&chrTemp[20])/32768*180;
		Angle[2] = (float)CharToShort(&chrTemp[22])/32768*180;
		
		printf("0x50:  a:%.3f %.3f %.3f w:%.3f %.3f %.3f  h:%.0f %.0f %.0f  Angle:%.3f %.3f %.3f \r\n",a[0],a[1],a[2],w[0],w[1],w[2],h[0],h[1],h[2],Angle[0],Angle[1],Angle[2]);		
		i++;
		if(i>10)//每隔10s左右IIC写入一次进行加速度校准
		{
			i=0;
			printf("IIC进行加速度校准\r\n");
			IICwriteBytes(0x50, CALSW, 2,&cmd1[1]);
		}
	
    }
}



